# StructuralSectionHssOuterfillet Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionHssOuterfillet Property
ParameterTypeId Class See Also
---
"Outer Fillet"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionHssOuterfillet { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionHssOuterfillet As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionHssOuterfillet {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace